vector<int> a,b;
a初始化50根蓝色棍子，b为空
初始化a[0]到a[49]排列在中间
a[0]一边旋转90度一边移动到最上方
for(6次){
	a[1]到a[49]排列在最中间
	for(int T=1;T<=3;T++){
		n=a.size()
		l=a[1].列坐标,r=a[n].列坐标//列表示从左到右的坐标，这一步得出点击的范围
		x=用户点击的列坐标
		num=min(n-2,max(1,(x-l)/(r-l)*n))
		a[0]到a[num]向左平移(a[0].列坐标-一根棍子的宽度)
		a[num+1]到a[n]向右平移(屏幕宽度- a[n].列坐标-一根棍子的宽度)
		a[num+1]一边缩短一边向下移动到下一行的中间
		ln=num%4
		if(ln==0)	ln=4;
		for(int i=5;i<=num-ln+1;i+=4){
			a[i]到a[num]向右平移一根棍子的宽度
		}
		a[num-ln+1]到a[num]一边缩短一边向下移动到下一行a[num+1]的左边
		rn=(n-num-1)%4;
		if(rn==0)	rn=4;
		for(int i=n-4;i>=num+1+rn;i-=4){
			a[num+2]到a[i]向左平移一根棍子的宽度
		}
		a[num+2]到a[num+1+rn]一边缩短一边向下移动到下一行a[num+1]的右边
		if(b.empty()){
			a[num-ln+1]到a[num+1+rn]一边恢复原来的长度一边向下移动到下一行的最左边
			a[num-ln+1]到a[num+1+rn]从a中移除，加入b中
		}
		else{
			a[num-ln+1]到a[num+1+rn]一边恢复原来的长度一边向下移动到下一行，使得a[num-ln+1]的左边与b.back()的右边紧贴
			a[num-ln+1]到a[num+1+rn]从a中移除，加入b中
		}
		if(T<=2){
			把a中所有的合并在一起，排列在中间
		}
		else{
			int x=(num-ln)/4+(n-num-1-rn)/4;
			x按照6，7，8，9得出对应的爻，添加在最下方的结果区
			b所有元素移动到第一行的中间//新加入
			b中所有元素移动到a中。
			把a中所有的（49个）排列在第一行的中间，回到最初状态
		}
	}
}